// 客家小炒食譜JavaScript版

var 食材1 = '五花肉',
    食材2 = '乾魷魚',
    食材3 = '豆干',
    食材4 = '芹菜',
    食材5 = '青蔥',
    食材6 = '蒜苗',
    食材7 = '辣椒',
    食材8 = '蒜頭';

var 調味料們 = ['醬油膏', '米酒', '砂糖', '白胡椒'];

function 切成條(某食材) {
    while (某食材還沒全部變成條狀) {
        切下一條細條;
    } 
    return 條狀某食材;
}

function 切成段(某食材) {
    while (某食材還很長) {
        切出一小段;
    } 
    return 段狀某食材;
}

function 切片(某食材) {
    while (某食材還沒全部變成片狀) {
        剪下一片;
    } 
    return 片狀某食材;
}

function 加入鍋中(某食材) {
    把某食材到到鍋子裡面炒;
}

// 先把食材切成我們要的形狀
// 例如: 食材2是乾魷魚 切好會變條狀乾魷魚
食材1 = 切成條(食材1);
食材3 = 切成條(食材3);
食材4 = 切成段(食材4);
食材5 = 切成段(食材5);
食材6 = 切成段(食材6);
食材7 = 切片(食材7);
食材8 = 切片(食材8);
食材2 = 切成條(食材2);
    
食材2泡水;

// 要泡30分鐘(就是 30 * 60 * 1000 毫秒) 時間到了以後做這些事
setTimeout(function() {
    把食材2撈起來備用;
    熱鍋;
    加入鍋中(食材1);
    鍋.addEventListener('鍋中物出油且表面略上色', function() {
        加入鍋中(食材2);
        加入鍋中(食材3);
        加入鍋中(食材7);
        加入鍋中(食材8);
        for (var i = 0, len = 調味料們.length; i < len; i++) {
            加入鍋中(調味料們[i]);
        }
        加入鍋中(食材4);
        加入鍋中(食材5);
        加入鍋中(食材6);
        if(一時技癢){
            甩鍋;
        }
        上蓋悶一下;
        起鍋;
    });
    
}, 30 * 60 * 1000);